tutorials/multiphaseEuler/wallCondensation/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitp
{
    type       limitPressure;
    min        8e4;
    max        1.2e5;
}

limitTgas
{
    type       limitTemperature;
    cellZone   all;
    min        300;
    max        453;
    phase      gas;
}

limitTliquid
{
    type       limitTemperature;
    cellZone   all;
    min        300;
    max        453;
    phase      liquid;
}

// ************************************************************************* //
